// Напишите программу, которая на входе принимает число и выдает его квадрат


Console.WriteLine("Введите целое число:");
int number = Convert.ToInt32(Console.ReadLine());
int sqare = number * number;
Console.WriteLine($"квадрат числа {number} = {sqare}");
